{
  "name": "My workflow",
  "nodes": [
    {
      "parameters": {},
      "type": "n8n-nodes-base.manualTrigger",
      "typeVersion": 1,
      "position": [
        -300,
        -60
      ],
      "id": "ca28dbf5-cc5a-4d08-a2b9-82338a412b3a",
      "name": "When clicking ‘Execute workflow’"
    },
    {
      "parameters": {
        "mode": "insert"
      },
      "type": "@n8n/n8n-nodes-langchain.vectorStoreInMemory",
      "typeVersion": 1.1,
      "position": [
        140,
        -80
      ],
      "id": "e234f6db-0302-4c5d-b38e-a1659fb653e6",
      "name": "Simple Vector Store"
    },
    {
      "parameters": {
        "model": "text-embedding-3-large",
        "options": {
          "dimensions": 3072
        }
      },
      "type": "@n8n/n8n-nodes-langchain.embeddingsOpenAi",
      "typeVersion": 1.2,
      "position": [
        -20,
        240
      ],
      "id": "1f22a9a6-8dfb-4367-a18c-3e2f41af51fb",
      "name": "Embeddings OpenAI",
      "credentials": {
        "openAiApi": {
          "id": "lj47mn9LqQnTpfxE",
          "name": "OpenAi (Reset)"
        }
      }
    },
    {
      "parameters": {
        "assignments": {
          "assignments": [
            {
              "id": "86c2c2d0-e2a4-4506-96ab-3ac3ed71c638",
              "name": "data",
              "value": "Transcript  Erica Chenoweth / Apr 24, 2025  On Friday, April 11, 2025, Erica Chenoweth, the Frank Stanton Professor of the First Amendment at Harvard Kennedy School, delivered a keynote address at a conference called Artificial Intelligence and Democratic Freedoms hosted by the Knight First Amendment Institute at Columbia University. The talk was titled “How AI Can Support Democracy Movements.” Video is available here. What follows is a lightly edited transcript of the remarks.   WASHINGTON, DC—APRIL 5, 2025: Demonstrators take part in the Hands Off! day of action against the Trump administration and Elon Musk on the National Mall. (Photo by Paul Morigi/Getty Images for Community Change Action) Thank you. Good afternoon, and thank you so much for inviting me to this very stimulating and important set of conversations. I want to give a few opening notes just to set the table in a way that I think dovetails really nicely with the last panel. First of all, before I get started, as you'll soon see, I know very little about AI. I'm a late bloomer, I have no tech background, and it's only because of my students, research assistants, and postdoc collaborators that I'm now engaged in this work at all. And so, I just want to give credit to where it's due, including to my colleague, Jason Lian, who's here.  What I do study is social movements. I study how social movements are propelled or destroyed, and that includes some angles that are related to technology but aren't exclusive to them. And so, what I want to do is talk about why, in spite of the common skepticism about the potential role of AI in people power movements in some corners today, I have become convinced that the stakes of our current political landscape are so high that we ought not entirely surrender the space of AI innovation to basically the tech sector and authoritarian governments themselves. This is, I'm sure, preaching to the converted, but I have some fairly specific ideas in mind.  Let me start by just reiterating something that was touched upon in the last panel about the current global democratic recession. For those that are unfamiliar with the work of our colleague Grant's organization, Freedom House, they have been tracking what many call the global democratic recession over the past 18 years, and have found a year-over-year decline in democracy worldwide every year over the past 18 years. This year, it's likely the case that the vast majority of the world's population is living under authoritarian forms of government. This trend is both because of backsliding and established democracies, because of the deepening of authoritarianism in already autocratic regimes, and serious autocratic challenges that are emerging in established and advanced democracies, the likes of which have not been seen in 100 years.  What's important to know is that in the past 100 years, the way out of democratic backsliding and of authoritarianism that had already consolidated was primarily through what you might call people power movements, movements that were making demands for democracy that resulted ultimately in major democratic breakthroughs on every continent. That includes cases that might come to mind from the late '80s, like Poland and the Solidarity Movement, the People Power Movement in the Philippines, the Democracy Movement in Brazil, or the Anti-Apartheid Movement in South Africa, the US Civil Rights Movement, and other major mass movements that expanded or brought democracy to a country in the postwar era.  What has been the fate of people power movements over the last few years? What we have seen is that, if you look at this graph, this is data that I maintain at my lab, and what we've seen is that the success rates of what you could call these mass democracy movements or revolutionary movements that are trying to oust incumbent national regimes, usually dictators, or create independent territories out of colonized territories through succession or self-determination, so these are what political scientists refer to as maximalist campaigns, because if they win, they're going to fundamentally reshape the nature of sovereignty and the state. What this is showing is that those that were primarily non-violent, those are people power movements where ordinary citizens are using protests, strikes, boycotts, stay-aways, go-slows, other forms of non-cooperation, to propel their movement, have succeeded really twice as often as their armed counterparts over the last 125 years.  But that success advantage has been declining, and the absolute success rates of people power movements have been declining especially fast over the last 10 years. I hasten to add that armed revolutionary movements are also becoming much less effective than they have been at any period in recorded history in the last 125 years, but the success rate of both has been declining at rates that we haven't seen in 100 years. That suggests that there's something that's global and systemic that's happening to all kinds of mass mobilization, not just that peaceful protest isn't effective or something like that, it's that, actually, the opponents of these movements have become better at defeating them in general.   New York, New York—April 11, 2025: Erica Chenoweth delivers remarks at Columbia University at a conference hosted by the Knight First Amendment Institute. Photograph by Eileen M. Barroso. The news is even worse than that. In new data that I'm soon going to publish with my colleague, Sooyeon Kang, we found that for reformist episodes of contention, these are those that wouldn't be those maximalist claims, like democracy movements or whatever, but they'd be reform movements, these would include wage and labor campaigns, they would include environmental movements, racial justice movements, the expansion of civil rights, gender rights, et cetera, these movements have also been defeated at higher and higher rates year-over-year over the past couple of decades, and declining even in their ability to achieve significant concessions short of full success during that same period. Success rates are basically flat, that is outright success of them getting everything they say they want, and this is true even though people are using these techniques of people power at much greater rates than they have ever before. So that's the puzzle that motivates the stakes that I'm laying out.  We do know, from a lot of different literature, the things that made people power movements so successful in the past in either reversing democratic backsliding or having major democratic breakthroughs in authoritarian regimes, and there are really four things that the literature focuses on. The first is the ability of mass movements to really attract a large and diverse, that is cross-cutting, participation from throughout their society. So the movements that win are the ones that have people from all walks of life participating, they tend to cut across racial and ethnic cleavages, class cleavages, urban-rural divides, partisan divides, and things along those lines. But importantly, they also elicit the support of people in different pillars of support that would be otherwise upholding the authoritarian status quo.  For example, the key insight that emerges from the civil resistance literature is that there's no such thing as an authoritarian regime that is truly monopolistic in its power, that every autocrat has to rely totally on the cooperation, obedience, and help of people in different pillars of support, whether that's the military and security forces, police, economic and business elites, state media, civil servants and others, who have to continually go along with things as they are in order for the autocrat to maintain power. And so, the key challenge for mass movements that are demanding a change to expand democracy is to begin to pull away or dislocate those pillars of support from the autocrat in terms of their loyalty.  You might know about the case of Serbia, where Slobodan Milosevic had been in power for a very long time and basically tried to steal an election in 2000, and there was a mass mobilization to prevent him from doing so, and at the key moment when the police were ordered to fire on unarmed demonstrators in the parliamentary square, the police pretended to not hear the order is what they did. So they just ignored it and pretended not to hear it, and activists knew that was happening because they had stolen walkie-talkies, heard the order come down, saw that it wasn't happening, and realized that they had won and declared victory. Milosevic fled the square and resigned, \"To spend more time with his grandson,\" was later arrested and died in custody while awaiting trial for crimes against humanity and war crimes.  Basically, the upshot of all of this is that if movements are able to basically apply pressure in a way that begins to pull apart the loyalty of the autocrat in key pillars of support, that's when it creates these crisis moments for the autocrat that create opportunities for pro-democracy forces to seize. This is basically how Pinochet's regime fell, this is how the Apartheid regime fell in South Africa, et cetera, et cetera.  The third thing that successful movements do is that when there are moments of repression against unarmed demonstrators, that they are able to make that repression backfire, and this often happens because as the public witnesses levels of brutality against people that obviously don't deserve it, it does begin to shift public sentiment and begin to tear apart the autocrat's call for legitimacy.  And then, the fourth thing that successful movements do is they don't over-rely on any particular tactic, like mass demonstrations, but they begin to maneuver and sequence tactics in ways that build pressure on their opponents while minimizing exposure to risk. For example, instead of just doing protests every day, day-after-day, in a way that becomes very predictable and perhaps even symbolic, they begin to show capacities for non-cooperation. Instead of going to the streets, they withdraw and stay at home for three days, which, as we all learned during COVID, can literally shut down an economy in ways that create immediate material impacts.  What I would argue is that these four pillars are known not just to movements, but now to autocrats, and what's going on is that there's been an unusually high level of coordination and uniformity in the ways that governments have adapted to the threat of people power movements, as well as active collaboration in defeating them, what you might call a new autocratic alliance. That new autocratic alliance has adapted four different strategies to undermine the four ways that movements win. The first is by making sure that nobody defects. The second is by dominating the information ecosystem and winning the information war. The third is by using selective repression in ways that make it very difficult for movements to exploit moments of intense brutality. And the fourth is perfecting the art of divide and rule.  Let me talk about what each of those looks like briefly. There's evidence from around the world that there's been a high level of learning that the main way that people power movements win is when your military, your police, your economic elites, don't support you. And so, what they do is they engage in political education during trainings of police, during trainings of the military, to say, \"Protesters are going to try to put a carnation in the end of your gun barrel, and those people are actually backed by our foreign enemies, and they're conspirators, and they're here to make sure that you betray your country, and you should never do that. That's the number one thing never to do.\" And so, this is now baked into political education that occurs in the process of training of security forces.  Preemptive payouts and payments to basically buy off one’s inner entourage are very common. Fragmenting the security apparatus, so that if one part of the security forces defect, not all of them will defect, is another key strategy that we are seeing around the world. The fourth is the delegation of repression to people who are in plain clothes or who don't look obviously like they can be assigned to any particular security force institution. The fifth is purges of obvious or suspected disloyalists. And the sixth is direct repression of disloyalists, so in other words, jailing them, or in some cases, charging them with treason and even executing them. These techniques together have made it more difficult for movements to elicit the defection of security forces, and we've seen that as an increasing trend over time.  The second key adaptation has been around winning the information war, and part of this has been around dominating information ecosystems by, of course, purchasing news outlets or crushing those that don't align more directly with the state through lawfare and sometimes through criminal proceedings. Using surveillance and intelligence collection, particularly now assisted by AI tools, as others have mentioned in previous panels, is a vast part of the toolkit that's expanding, both in its scope and its sophistication. Flooding the zone with rumors, disinformation, and propaganda, some of which might be created by and tested by different AI tools, is part of the toolkit. And then also, shutting down the internet at times when it's convenient to do so and then turning it on when it's convenient to do so is part of it.  So in Myanmar, you might recall the Civil Disobedience Movement that rose up against the coup there. One of the techniques that was imported from another authoritarian regime was being able to shut off Facebook, the internet, really, so that people couldn't use Facebook to organize against the regime. But then, when the regime would do something truly awful to an activist, they would open it again so that people could share the horrific news about a torturous method of execution, and then shut it off again so that people could get the bad news and be terrorized but not organize a response.  Our content. Delivered. Join our newsletter on issues and ideas at the intersection of tech & democracy  Selective repression is the third part of the toolkit. It is minimizing the exposure to threats to their legitimacy by not cracking down on everyone, but instead using particular individuals that the regime assumes are easy to mischaracterize and characterizing them with the most egregious crimes, like terrorism, treason or plotting coups. Avoiding public shows of brutality, but using that selective terror to make examples of people and jailing rather than murdering others. Lawfare is another key administrative tool that is being used, as was mentioned also during the previous panel.  And then, the fourth set of key strategies is perfecting the art of divide and rule, and this is really just fomenting greater social divisions in a way that provides an equilibrium that's easy to control. So encouraging loyalist and pro-autocratic mobilization, reinforcing or even inducing divisions within movements, usually along identity lines or whatever the relevant cleavage is in the society at a given moment, infiltrating movements in a way that provokes them to be indisciplined in the way that they conduct their strategy and tactics, stoking identity-based conflicts more generally outside of a movement so that the movement is viewed in a certain light by the public. And then, of course, isolating, dividing and scapegoating minority groups within the country in a way that make it more challenging to establish clear channels of solidarity.  So this is formidable terrain, and I think technology and technological innovation has played a role. It has played a role in all of the dimensions of adaptation that are being used to make mass movements less effective, and I think the primary domain in which AI tools particularly are being used is in the latter three. So I go to pains to describe this landscape just to underscore the fact that this is very formidable terrain, that democracy movements around the world have really been struggling to operate effectively and to adapt to this autocratic playbook, especially because there's such large-scale collaboration between regimes. And so, my argument would basically be that we need an upgraded playbook to deal with these adaptations, and also to innovate in new ways.   New York, New York—April 11, 2025: Erica Chenoweth delivers remarks at Columbia University at a conference hosted by the Knight First Amendment Institute. Photograph by Eileen M. Barroso. So there are lots of different elements to this playbook that derive specifically from the different ways that we know that mass movements succeed, and for our purposes, I think the fourth here, exploiting novel technologies, is the most relevant. So enter my wonderful research assistants and colleagues who convinced me of the possibilities of AI. So the way this went down is that a couple of years ago, a bunch of us were sitting around in my lab and we were talking about this decline in the effectiveness of movements and whether or not technology had something to do with it. And for about the 150th time, one of my students said, \"What do you think about AI in movements?\" And I said, \"I don't think anything about AI in movements, I just have no idea how to wrap my mind around it.\" And one of the other people said, \"Well, why don't we try to think about, as a group, think a little bit more about it?\" And I joked, I said, \"Well, why don't you open up ChatGPT and put in there, 'How can AI support democracy movements?' Ha-ha-ha.\"  And so, the research assistant did do that, and ChatGPT produced a very long thesis with some very clear examples of ways that AI could support movements, and it got us talking as a group. Since then, we actually organized a workshop last December with activists from around the world who have been in some of these extremely beleaguered movements, with scholars who study the intersection between technology, social movements, and repression, and with some people from the tech space who have been trying to innovate new applications of AI to support democracy and democracy movements, and we tested out some of these ideas.  So what I want to say here is that when we are talking about exploiting novel technologies, the main thing that comes through here is just that if movements don't think systematically about how to appropriate any technology that is floating around in their universe, that becomes a major vulnerability for them, especially when there's an arms race of the kind that we're now seeing around AI. And so, all movements tend to ultimately appropriate, and sometimes even quite innovatively, use emerging technologies or disruptive technologies to their advantage. Certainly, we saw this in the heady days of the arrival of the internet when it did seem the case that movements were some of the more innovative spaces in which the internet was being used to organize and mobilize. But there has been much more caution and skepticism across many movements in doing this with AI for all of the reasons that folks have been mentioning.  But if you think about some of the challenges that movements are having, particularly in this new autocratic alliance era, one of the major issues that they have is actually just getting a sense of what their operational landscape is. So, who is connected to whom? Where are the financial interests? Who is on their side? Who is not on their side? Can you map the pillars that would be relevant to the autocrat's support? Can you identify or predict where there might be vulnerabilities? All of these things become increasingly challenging for people to do themselves without exposing themselves to major risks, and if there are ways that technologies can be useful, at least in providing alternative scenarios that can get people thinking creatively about how to approach and sequence tactics around their current environment, this could be a huge benefit to a lot of movements.  Communication and outreach is another area where a lot of movements invest a lot of person hours. And I was talking with somebody before this that if movements could be freed from that type of time, because there was something that was helping them generate content so that they could be thinking about these big strategic questions that need attention, that would probably not be a bad thing. I think a lot of people would be relieved that they didn't have to spend as much time on things that could be assisted with a tool. Sentiment analysis, oppositional research analysis, which I've already discussed, and the ability to monitor anomalies that might indicate an operational security threat to a movement would be very helpful for most movements. This is not something that most of them have the capability for, but really need it. Being able to allocate resources in a much more efficient way, particularly when it comes to tactical sequencing, would be an area in which we can imagine AI-assisted tools making an impact.  So for example, one of the things that a lot of movements eventually do try to do is they try to figure out whether their strategy in running a particular campaign is going to be effective or not. Now, there are a couple of different ways to do that. One is by red teaming it with a bunch of people who know things about the current environment. Another one is just to go out and try and see what happens. Both of those become increasingly risky in the current terrain, and so if there are ways to create coaches that can tutor movements in ways that are safer or don't expose them to as much risk, that could also be a very worthy set of experiments.  Legal assistance is something that is in huge demand, and this could be anything from trying to connect people with legal resources when they're under attack, to helping to design or write briefs or documentation, petitions, things that actually put in the public record abuses that are happening. It's really important to underscore how important it is for there to be the documentation of abuses put into the public record, which is often what legal briefs can do because without that, it's very difficult sometimes to get accountability down the road. Organizing rapid response, response to threats to personnel or assets, can be a very important application. Even just networking, figuring out who else is in one's civil society space that might be aligned or might be able to join in some kind of campaign is something that's beyond the capacity of many movements when they are under attack. And then, finally, as I mentioned, just even doing things like strategic and tactical coaching, getting a sense of where the vulnerabilities are in a particular plan, who it's likely to affect, who it's unlikely to affect, could be very important.  One of our team members was pointing out a very impressive application, I'm not sure if it has come up yet at this conference or not. But in 2018, during the Russian municipal elections, there was a group that developed an algorithm to study the CCTV web footage of every polling station in Russia, which is maybe millions of hours of footage, and they came up with an algorithm that was able to detect irregularities in human interactions with the ballot box.  So for example, there's a certain set of movements that people do when they're trying to put a ballot in the ballot box, and it taught the algorithm how to detect that. And then, it taught the algorithm to point out if there were irregularities, like if people weren't just doing this in the ballot box. And so, then they showed video of times when humans were going like this to the ballot box, and so then they zoomed in on those videos and they were able to identify hundreds of instances where ballots were just shoved into the ballot box that were pre-marked, and you can see those videos on the footage. So these are examples of applications that would be very difficult for humans to do, because of the millions of hours of footage, but that there are natural applications for movements.  The last thing I'll say is just aggregating information about how people can be involved in a movement is crucial in times of democratic backsliding. So you might be familiar with the BuyCat app or the BoyCott app or the No Thanks app, these are all applications that have aggregated information about campaigns to encourage consumer boycotts of particular products or companies. Examples like that make it just more accessible for people to participate in a movement without giving any sign really that they're doing so.  One of really big issues that arises here is the lack of coordination and lesson sharing across different movements from around the world, and some of that's deliberate. It can be very difficult to collaborate, especially when there are language barriers and other things. By the way, that's another potential application for AI-assisted tools is just better translation interpretation. But I think that there are three things that are already underway that can really be built upon effectively to deal with the problems of the current authoritarian alliance.  The first is more training and strategy convenings that explicitly address some of the key vulnerabilities that exist in the current terrain. There are groups that have started to develop tech-specific tools, like CANVAS, which has a initiative called AI Intelligence. There's the Social Movement Technologies group that has been doing activist trainings on AI applications and things like that, and there are other groups that are working on trying to figure out how this could be made the most effective. Certainly, developing and sustaining a global network of pro-democracy movements and supporters that include tech supporters I think is pretty urgent at this time. And then, trying to figure out more effective ways to build in feedback loops of knowledge to practice and vice versa would be very helpful. For example, developing an infrastructure to where we can assess whether AI-assisted tools are actually helping or making things more difficult for movements is an urgent task.  So a few other things to mention that certainly came up at the workshop and are on my mind as puzzles that I know all of you have undoubtedly thought through. So the first is the issue about sharing sensitive data, particularly things like movement plans or strategies, into applications or platforms where there's no commitment to human rights on the back-end. So there needs to be the development of independent and ethically-aligned platforms that people can actually test in a sandbox some of their ideas without it falling into the literal opposite hands of who they would want it to fall into. That can take some computational power, as you know, and so is something that wouldn't necessarily be as accessible to everyone around the world as others, but seems to be a very important first step.  The second big caveat is one that is a bit more troubling for me, which is that if we were going to train a bunch of different coaching or strategic tools on the existing corpus of substantive material about how civil resistance works for democracy movements, we'd be training it on largely data from the past 125 years, where we've already been seeing a decline in the effectiveness of these movements and we have no idea if the world in which we are now in and entering into is going to contain the same lessons as what we saw over the past 125 years. Now, I don't know what that means about what we should be training this stuff on, but I think that we need to be cautious about assuming that what worked 60 years ago is what will work today, particularly with the United States being in the state that it's in.  The third big caveat is that people power is still always going to be people power, and obviously we can't substitute for the value of the deliberative messy processes that are the stuff of democracy and that are what unleash the creativity of movements when they do gain the upper hand. But we do want to think about ways in which we can preserve some of the precious time that activists and organizers and leaders of these movements need to do the difficult work of deliberation and democracy, and in that sense, I think AI-assisted tools could be quite useful. And I think the most important task here is trying to figure out if there exists some kind of ethical code of conduct for how people use these tools. If it does, please tell me what it is and who did it. If it doesn't exist, let's please make it so that we can align on some core guardrails about how to use these tools for good.  I hope to enlist those who are much more knowledgeable than I am, which is to say probably all of you, in the project of supporting movements that are committed to basic rights, rule of law, checks and balances, and pursuing the emancipatory and egalitarian values and institutions that have allowed so many to prosper over the last century. And as imperfect as our democratic project has been, we will sure be sorry when it's over, and so I do hope that we will find ways to address the new autocratic alliance in ways that bring about the fourth wave of democracy. Thank you.  Authors Erica Chenoweth is the Frank Stanton Professor of the First Amendment at Harvard Kennedy School and a Susan S. and Kenneth L. Wallach Professor at the Radcliffe Institute for Advanced Studies at Harvard University. They study political violence and its alternatives. At Harvard, Chenoweth directs the...",
              "type": "string"
            }
          ]
        },
        "options": {}
      },
      "type": "n8n-nodes-base.set",
      "typeVersion": 3.4,
      "position": [
        -120,
        -60
      ],
      "id": "6780e185-ce95-4abd-b3c6-e1229c8b7216",
      "name": "Edit Fields"
    },
    {
      "parameters": {},
      "type": "@n8n/n8n-nodes-langchain.textSplitterTokenSplitter",
      "typeVersion": 1,
      "position": [
        380,
        480
      ],
      "id": "13fd67ea-fb54-456b-82d9-703f7c16f94d",
      "name": "Token Splitter"
    },
    {
      "parameters": {},
      "type": "@n8n/n8n-nodes-langchain.embeddingsGoogleGemini",
      "typeVersion": 1,
      "position": [
        -220,
        100
      ],
      "id": "ec18d5a9-825b-4cfc-8bb9-442f0e753845",
      "name": "Embeddings Google Gemini"
    },
    {
      "parameters": {
        "options": {}
      },
      "type": "CUSTOM.documentLoader",
      "typeVersion": 1,
      "position": [
        -340,
        260
      ],
      "id": "6a7a253a-5523-4ff6-8b3a-41c8cc40c1c1",
      "name": "Document Loader"
    },
    {
      "parameters": {
        "options": {}
      },
      "type": "CUSTOM.textSplitterSemanticDoublePass",
      "typeVersion": 1,
      "position": [
        620,
        280
      ],
      "id": "6ee646bb-cb52-44ce-b0c8-4dca10fc7d18",
      "name": "Semantic Double-Pass Merging Text Splitter"
    },
    {
      "parameters": {
        "options": {}
      },
      "type": "CUSTOM.contextualDocumentLoader",
      "typeVersion": 1,
      "position": [
        540,
        20
      ],
      "id": "9705b4ca-2f13-4f38-aa92-e4768156c346",
      "name": "Contextual Document Loader"
    },
    {
      "parameters": {
        "model": {
          "__rl": true,
          "mode": "list",
          "value": "claude-3-7-sonnet-20250219",
          "cachedResultName": "Claude 3.7 Sonnet"
        },
        "options": {}
      },
      "type": "@n8n/n8n-nodes-langchain.lmChatAnthropic",
      "typeVersion": 1.3,
      "position": [
        420,
        220
      ],
      "id": "a45896e4-2369-40be-9da8-af533eb78da4",
      "name": "Anthropic Chat Model"
    },
    {
      "parameters": {
        "inputs": {
          "input": [
            {
              "type": "ai_textSplitter"
            }
          ]
        },
        "outputs": {
          "output": [
            {
              "type": "ai_document"
            }
          ]
        }
      },
      "type": "@n8n/n8n-nodes-langchain.code",
      "typeVersion": 1,
      "position": [
        580,
        440
      ],
      "id": "ebb3e930-5313-4682-a1f4-da981e910c35",
      "name": "LangChain Code"
    },
    {
      "parameters": {
        "code": {
          "supplyData": {
            "code": "// --- Part 1: Get the TextSplitter instance ---\n// Your 'ai_textSplitter' input pin is named \"input\" in your node's JSON configuration.\n// We use its TYPE for getInputConnectionData.\nconsole.log(\"Attempting to retrieve TextSplitter instance via this.getInputConnectionData('ai_textSplitter', 0)\");\nconst receivedSplitterData = await this.getInputConnectionData('ai_textSplitter', 0);\nlet textSplitterInstance;\n\nif (Array.isArray(receivedSplitterData) && receivedSplitterData.length > 0) {\n    const potentialInstance = receivedSplitterData[0];\n    if (potentialInstance && typeof potentialInstance.createDocuments === 'function') {\n        textSplitterInstance = potentialInstance;\n        console.log(\"Successfully retrieved TextSplitter instance. Type:\", textSplitterInstance.constructor ? textSplitterInstance.constructor.name : typeof textSplitterInstance);\n    }\n}\n\nif (!textSplitterInstance) {\n    console.error(\"Failed to retrieve a valid TextSplitter instance from 'ai_textSplitter' connection. Data received:\", receivedSplitterData);\n    throw new Error('Could not retrieve a valid TextSplitter instance. Ensure \"Token Splitter\" node is connected to the ai_textSplitter input pin and is providing its instance.');\n}\n\n// --- Part 2: Get the main input data (the transcript text) ---\nconsole.log(\"Attempting to retrieve main data items for splitting...\");\n\n// === COMPREHENSIVE INPUT DATA DEBUGGING ===\nconsole.log(\"=== DEBUGGING INPUT DATA ===\");\nconsole.log(\"this.getInputData type:\", typeof this.getInputData);\n\n// Get all input data\nconst mainInputItems = this.getInputData();\n\nconsole.log(\"Raw mainInputItems:\", mainInputItems);\nconsole.log(\"mainInputItems type:\", typeof mainInputItems);\nconsole.log(\"mainInputItems is array:\", Array.isArray(mainInputItems));\nconsole.log(\"mainInputItems length:\", mainInputItems ? mainInputItems.length : 'null/undefined');\n\n// Detailed analysis of input structure\nif (mainInputItems && Array.isArray(mainInputItems) && mainInputItems.length > 0) {\n    console.log(\"=== ANALYZING FIRST ITEM ===\");\n    const firstItem = mainInputItems[0];\n    console.log(\"First item:\", firstItem);\n    console.log(\"First item type:\", typeof firstItem);\n    console.log(\"First item keys:\", Object.keys(firstItem || {}));\n    \n    if (firstItem && firstItem.json) {\n        console.log(\"First item JSON data:\", firstItem.json);\n        console.log(\"First item JSON keys:\", Object.keys(firstItem.json));\n        console.log(\"Available text fields in first item:\");\n        \n        // Check for common text field names\n        const textFields = ['data', 'text', 'content', 'document', 'message', 'body', 'description'];\n        textFields.forEach(field => {\n            if (firstItem.json[field] !== undefined) {\n                console.log(`  - ${field}: ${typeof firstItem.json[field]} (length: ${typeof firstItem.json[field] === 'string' ? firstItem.json[field].length : 'N/A'})`);\n                if (typeof firstItem.json[field] === 'string' && firstItem.json[field].length < 200) {\n                    console.log(`    Preview: \"${firstItem.json[field].substring(0, 100)}...\"`);\n                }\n            }\n        });\n    }\n    \n    if (firstItem && firstItem.binary) {\n        console.log(\"First item has binary data:\", Object.keys(firstItem.binary));\n    }\n} else {\n    console.log(\"No valid input items found or input is not an array\");\n}\n\n// Try alternative input methods for debugging\nconsole.log(\"=== TRYING ALTERNATIVE INPUT METHODS ===\");\ntry {\n    const inputData0 = this.getInputData(0);\n    console.log(\"getInputData(0) result:\", inputData0);\n    console.log(\"getInputData(0) length:\", inputData0 ? inputData0.length : 'null/undefined');\n} catch (e) {\n    console.log(\"getInputData(0) error:\", e.message);\n}\n\ntry {\n    const inputData1 = this.getInputData(1);\n    console.log(\"getInputData(1) result:\", inputData1);\n} catch (e) {\n    console.log(\"getInputData(1) error:\", e.message);\n}\n\n// Check node information\nconsole.log(\"=== NODE INFORMATION ===\");\ntry {\n    const node = this.getNode();\n    console.log(\"Node info:\", {\n        name: node.name,\n        type: node.type,\n        typeVersion: node.typeVersion\n    });\n} catch (e) {\n    console.log(\"Error getting node info:\", e.message);\n}\n\nconsole.log(\"=== END DEBUGGING ===\");\n\n// --- Part 3: Process the input data ---\nconsole.log(`Processing ${mainInputItems ? mainInputItems.length : '0'} item(s) from input data...`);\n\nif (!mainInputItems || mainInputItems.length === 0) {\n    console.warn(\"No items received from input. Node will output an empty documents array. Ensure your text data source is connected to this node and is providing data.\");\n    return []; // Return empty array if no input text\n}\n\nconst allSplitDocuments = [];\n\nfor (let i = 0; i < mainInputItems.length; i++) {\n    const item = mainInputItems[i];\n    \n    if (!item || !item.json) {\n        console.warn(`Item ${i} is invalid or missing JSON data. Skipping.`);\n        continue;\n    }\n    \n    // Get text content from the item - try multiple common field names\n    let textToSplit = '';\n    const jsonData = item.json;\n    \n    // Try common text field names in order of preference\n    const textFieldCandidates = ['data', 'text', 'content', 'document', 'message', 'body', 'description'];\n    \n    for (const fieldName of textFieldCandidates) {\n        if (jsonData[fieldName] && typeof jsonData[fieldName] === 'string' && jsonData[fieldName].trim() !== '') {\n            textToSplit = jsonData[fieldName];\n            console.log(`Item ${i}: Using field '${fieldName}' for text content (length: ${textToSplit.length})`);\n            break;\n        }\n    }\n    \n    // If no specific text field found, try converting entire JSON to string as fallback\n    if (!textToSplit) {\n        textToSplit = JSON.stringify(jsonData);\n        console.log(`Item ${i}: No specific text field found, using entire JSON as string (length: ${textToSplit.length})`);\n    }\n    \n    // Create metadata for this item\n    const sourceMetadata = {\n        source: jsonData.source || `input_item_${i}`,\n        loaded_at: new Date().toISOString(),\n        loader_type: 'custom-code-node-input',\n        item_index: i,\n        ...jsonData.metadata // Include any existing metadata\n    };\n\n    if (typeof textToSplit !== 'string' || textToSplit.trim() === \"\") {\n        console.warn(`Item ${i} (source: ${sourceMetadata.source}) does not contain valid text content. Available fields:`, Object.keys(jsonData), '. Skipping this item.');\n        continue;\n    }\n\n    console.log(`Processing text from item ${i} (source: ${sourceMetadata.source}, text length: ${textToSplit.length})...`);\n\n    try {\n        const documents = await textSplitterInstance.createDocuments([textToSplit], [sourceMetadata]);\n        console.log(`Item ${i} (source: ${sourceMetadata.source}): Successfully split into ${documents.length} LangChain Document(s).`);\n        allSplitDocuments.push(...documents);\n    } catch (error) {\n        console.error(`Error during textSplitterInstance.createDocuments() for item ${i} (source: ${sourceMetadata.source}):`, error);\n        // Continue processing other items even if one fails\n    }\n}\n\nconsole.log(`Total documents created from input data: ${allSplitDocuments.length}`);\nreturn allSplitDocuments;"
          }
        },
        "inputs": {
          "input": [
            {
              "type": "ai_textSplitter"
            }
          ]
        },
        "outputs": {
          "output": [
            {
              "type": "ai_document"
            }
          ]
        }
      },
      "type": "@n8n/n8n-nodes-langchain.code",
      "typeVersion": 1,
      "position": [
        80,
        240
      ],
      "id": "774a84ae-59d8-46a7-b2b5-7264cbe91c67",
      "name": "Custom Document Loader (current)",
      "alwaysOutputData": true
    },
    {
      "parameters": {
        "code": {
          "supplyData": {
            "code": "// Log the attempt\nconsole.log(\"Attempting to retrieve TextSplitter via this.getInputConnectionData('ai_textSplitter', 0)\");\n\n// getInputConnectionData is expected to return the LangChain component instance.\n// Based on new logs, it seems to return an ARRAY containing the component.\nconst receivedData = await this.getInputConnectionData('ai_textSplitter', 0);\n\n// --- DETAILED LOGGING of receivedData and potential instance ---\nconsole.log(\"Value received from this.getInputConnectionData('ai_textSplitter', 0):\", receivedData);\n\nlet textSplitterInstance;\n\nif (Array.isArray(receivedData) && receivedData.length > 0) {\n    console.log(\"Detailed check: receivedData is an array with length\", receivedData.length);\n    const potentialInstance = receivedData[0]; // Get the first element from the array\n    console.log(\"Detailed check: Potential instance (receivedData[0]):\", potentialInstance);\n\n    if (potentialInstance && typeof potentialInstance.createDocuments === 'function') {\n        textSplitterInstance = potentialInstance;\n        console.log(\"Detailed check: Successfully extracted TextSplitter instance from receivedData[0]. Instance type: \" + (textSplitterInstance.constructor ? textSplitterInstance.constructor.name : typeof textSplitterInstance));\n    } else if (potentialInstance) {\n        console.error(\"Detailed check: receivedData[0] IS NOT a valid TextSplitter (missing createDocuments method).\");\n        console.error(\"Type of receivedData[0]:\", typeof potentialInstance);\n        if (potentialInstance.constructor && potentialInstance.constructor.name) {\n            console.error(\"Constructor name of receivedData[0]:\", potentialInstance.constructor.name);\n        } else {\n            console.error(\"receivedData[0] has no identifiable constructor name.\");\n        }\n        try {\n            console.error(\"Keys of receivedData[0]:\", Object.keys(potentialInstance));\n        } catch (e) {\n            console.error(\"Could not get keys of receivedData[0]:\", e.message);\n        }\n    } else {\n         console.error(\"Detailed check: receivedData[0] is null or undefined.\");\n    }\n} else if (receivedData && typeof receivedData.createDocuments === 'function') {\n    // Fallback: maybe it's not an array but the instance itself (less likely given logs)\n    textSplitterInstance = receivedData;\n    console.log(\"Detailed check: receivedData was not an array but IS a valid TextSplitter. Instance type: \" + (textSplitterInstance.constructor ? textSplitterInstance.constructor.name : typeof textSplitterInstance));\n} else {\n    console.error(\"Detailed check: receivedData is null, undefined, not an array, or an empty array.\");\n}\n// --- END DETAILED LOGGING ---\n\n// Validate the instance and throw an error if it's not usable.\nif (!(textSplitterInstance && typeof textSplitterInstance.createDocuments === 'function')) {\n    throw new Error('Could not retrieve a valid TextSplitter instance using getInputConnectionData(\\'ai_textSplitter\\', 0). The method returned data, but it was not structured as expected or did not contain a valid TextSplitter instance at the first index of the returned array. See logs above for details.');\n}\n\n// This part of the code will only execute if textSplitterInstance is valid.\nconsole.log(\"Proceeding with document creation using the TextSplitter instance...\");\n\nconst textsToLoad = [\n  \"This is the first document. It contains several sentences and is intended to be split into smaller chunks by the provided text splitter. This demonstrates the custom data loader functionality.\",\n  \"Here is a second document. It also serves as input for the text splitting process, ultimately becoming LangChain Document objects ready for a vector store.\"\n];\n\nconst metadatas = [\n  { source: 'custom-loader-doc1', 'loaded_at': new Date().toISOString(), 'loader_type': 'custom-code-node' },\n  { source: 'custom-loader-doc2', 'loaded_at': new Date().toISOString(), 'loader_type': 'custom-code-node' }\n];\n\ntry {\n    const documents = await textSplitterInstance.createDocuments(textsToLoad, metadatas);\n    console.log(`Successfully created ${documents.length} LangChain Document(s).`);\n    return documents;\n} catch (error) {\n    console.error(\"Error during textSplitterInstance.createDocuments():\", error);\n    throw new Error(`Error when trying to use the TextSplitter instance: ${error.message}`);\n}"
          }
        },
        "inputs": {
          "input": [
            {
              "type": "ai_textSplitter"
            }
          ]
        },
        "outputs": {
          "output": [
            {
              "type": "ai_document"
            }
          ]
        }
      },
      "type": "@n8n/n8n-nodes-langchain.code",
      "typeVersion": 1,
      "position": [
        340,
        240
      ],
      "id": "990fd5e5-0d04-48e1-b0f9-163eeb5926b0",
      "name": "Custom Document Loader (old)",
      "alwaysOutputData": true
    }
  ],
  "pinData": {},
  "connections": {
    "When clicking ‘Execute workflow’": {
      "main": [
        [
          {
            "node": "Edit Fields",
            "type": "main",
            "index": 0
          }
        ]
      ]
    },
    "Embeddings OpenAI": {
      "ai_embedding": [
        [
          {
            "node": "Simple Vector Store",
            "type": "ai_embedding",
            "index": 0
          }
        ]
      ]
    },
    "Simple Vector Store": {
      "main": [
        []
      ]
    },
    "Edit Fields": {
      "main": [
        [
          {
            "node": "Simple Vector Store",
            "type": "main",
            "index": 0
          }
        ]
      ]
    },
    "Token Splitter": {
      "ai_textSplitter": [
        [
          {
            "node": "Custom Document Loader (old)",
            "type": "ai_textSplitter",
            "index": 0
          }
        ]
      ]
    },
    "Embeddings Google Gemini": {
      "ai_embedding": [
        []
      ]
    },
    "Contextual Document Loader": {
      "ai_document": [
        []
      ]
    },
    "Semantic Double-Pass Merging Text Splitter": {
      "ai_textSplitter": [
        [
          {
            "node": "Contextual Document Loader",
            "type": "ai_textSplitter",
            "index": 0
          }
        ]
      ]
    },
    "Anthropic Chat Model": {
      "ai_languageModel": [
        [
          {
            "node": "Contextual Document Loader",
            "type": "ai_languageModel",
            "index": 0
          }
        ]
      ]
    },
    "Custom Document Loader (current)": {
      "ai_document": [
        []
      ]
    },
    "Custom Document Loader (old)": {
      "ai_document": [
        [
          {
            "node": "Simple Vector Store",
            "type": "ai_document",
            "index": 0
          }
        ]
      ]
    }
  },
  "active": false,
  "settings": {
    "executionOrder": "v1"
  },
  "versionId": "319174f8-93f3-4915-b098-0d8277ce11ae",
  "meta": {
    "templateCredsSetupCompleted": true,
    "instanceId": "6f4f98db4fe962613961d28f2a5a973adb4e401217b889a90f40b2aeaaeb69f9"
  },
  "id": "4ZKlmyR4M1f0yUwl",
  "tags": []
}